post/10.org
#+title: Weekly#10
#+date: <2024-09-28 Sat>

#+begin_src js
  // What does this evaluate to?
  Array.from({ length: 26 }, (x, i) => (i + 10).toString(36)).join(", ")
#+end_src

* News | Article

** [[https://blog.jim-nielsen.com/2024/sanding-ui/][Sanding UI]]

作者使用 flex 布局实现 radio box，在 label 和 input 之间设置了 gap，发现无法点击，对用户不友好，然后用 padding 替换了 gap。

#+begin_quote
It’s a small thing, but lots of small splinters lead to an agonizing experience.

这是件小事，但很多小碎片会导致痛苦的经历。

So my recipe is: sand it, feel the grain, get a splinter, sand again, and repeat until smooth.

所以我的秘诀是：打磨，感觉纹理，有刺，再打磨，重复直到光滑为止。
#+end_quote

** [[https://switowski.com/blog/i-like-makefiles/][I Like Makefiles]]

#+begin_quote
The reason I like makefiles is that they often follow an unwritten convention of implementing the same set of commands to get you up and running.

我之所以喜欢 makefile，是因为它们通常遵循一种不成文的惯例，即执行同一套命令即可启动和运行。
#+end_quote

作者喜欢 makefile，是因为它相对来说比较统一，在不同地方构建一般都是 install，build，dev 几个命令，他自己也会使用 makefile 整合其他构建工具。

这样可以减少心智负担，要构建就执行 =make build= 就好了。

就像有的人会买很多同样的衣服，每天就从同样的衣服里拿，不用纠结穿什么衣服。

makefile 相关的资源还有：

- [[https://github.com/theicfire/makefiletutorial][makefile tutrorial]]
- [[https://gagor.pro/2024/02/how-i-stopped-worrying-and-loved-makefiles/][How I stopped worrying and loved Makefiles]]

** [[https://news.ycombinator.com/item?id=41622632][What's inside the QR code menu at this cafe?]]

作者在咖啡店扫了二维码，无聊用网页打开，找到了订单系统的 API，通过 API 可以给其他人下单，获取其他门店的交易情况。

一个二维码把整个订单系统都暴露了。

不过文章已经下架了。 ┐(シ)┌

** [[https://netninja.com/2024/02/05/its-okay-to-abandon-things/][It’s Okay to Abandon Things]]

和作者类似，当我开始读一本书的时候，如果没有读完，我就不愿意读另一本书。

尽管对在读的这本书不感兴趣了，还得逼着自己读完。

因为不想读，就搁置在一边，但又不肯开一本新书。

作者的建议是可以增加一个“远离书架”：

当一本书不想读的时候，可以快速看看结尾，或者看看别人的书评，然后将它放入到“远离书架”。

这样你依然有机会看这本书，但从精神上把它放一边，让自己可以轻松一些，去看新的书。

#+begin_quote
由于上述原因，我的 "当前阅读 "书架上只能有一本书，而且我必须在读完这本书后才能把它移到 "已读 "书架上，然后再换一本新书。

去年年底，我创建了第四个书架："远离 "书架。

如果我读一本书读得不开心，这个新书架就会给我一定的精神许可，让我可以把它移到 "远离 "书架，继续我的生活。

这只是一件小事，似乎并不重要，但它却能让我的大脑允许我不必读完这本书。

我仍在追踪这本书，以及我开始写这本书的事实。

我没有把它从我的 Goodreads 上完全删除。我只是在精神上（以及在网站上）把它放在一边，为其他东西腾出空间。

谁知道呢？也许我以后还会再看，但可能不会了。

书架让它保持开放性，但也不会被人遗忘。
#+end_quote

#+begin_quote
对于电影，至少是在家里看的流媒体电影，我坚持 "十分钟原则"。

如果有人在看电影的前十分钟内不感兴趣，就可以拔掉插头。
#+end_quote

我觉得 GTD (Getting Thing Done) 也是类似的策略，它要求你将生活的所有事情收集起来，放到一个系统中，这样脑子就不用一直记着有什么事情没做，脑子就会轻松很多，可以去思考别的事情。

如果对 GTD 感兴趣，可以看看 [[https://www.youtube.com/watch?v=gCswMsONkwY&ab_channel=SuccessfulByDesign][Getting Things Done (GTD) by David Allen - Animated Book Summary And Review]] 。

** [[https://htmx.org/essays/you-cant][You Can't Build Interactive Web Apps Except as Single Page Applications... And Other Myths]]

翻译一下标题：2024 年了，MPA(Multiple Page Application，多页面应用) 能不能用？

作者澄清了一些 MPA 开发的误区，看起来目前使用 MPA 也能得到不错的交互体验。

#+begin_quote
在我们不经意间，浏览器已经缩小了差距，并借鉴了单页面应用程序革命的最佳理念。

...

因此，现在我们可以主要使用浏览器工具 -- HTML、CSS，也许还有一些 Javascript -- 来构建交互性很强的甚至是离线的网络应用程序，而且在用户体验方面仍然不会有太大的损失。

浏览器已取得长足进步。给它一个机会吧！
#+end_quote

** [[https://catskull.net/thoughts-on-debugging.html][Thoughts on Debugging]]

#+begin_quote
Here’s my one simple rule for debugging:

*Reproduce the issue.*

That’s the only thing, really.

There are a lot of barriers to this. This is the antithesis to “it works on my machine”.

Debugging is answering the question “why?”.

Magic exists, but I’ve never seen any in software. Problems are logical. Nothing is impossible.

You can solve this problem. You just need to reproduce the issue.

Reproducing the issue should be the team’s number 1 priority.

The issue must be reproduced exactly, not just symptoms of the same behavior.

这是我调试的一个简单规则:

*重现问题。*

这就是关键所在。这其中存在许多障碍。这与"在我的机器上运行正常"的理念完全相反。

调试就是回答"为什么?"这个问题。

魔法存在，但我从未在软件中见过任何魔法。问题是逻辑性的。没有什么是不可能的。

你能解决这个问题。你只需要重现这个问题。

重现问题应该是团队的首要任务。

必须准确地重现问题，而不仅仅是同样行为的症状。
#+end_quote

确实，所谓的“偶现问题”，很多时候只是找不到重现问题的方法。

#+begin_quote
Often the solution will naturally present itself in the course of debugging, usually by the time you’re successfully reproducing the issue.

It could be that by reproducing the problem, you are gaining the required knowledge to fix it.

However I think there very few actually hard problems and you’re probably not smart and/or lucky enough to work on one.

I’m not sure that I’ve ever worked on a hard problem, at least not for work.

We’re mostly just shoveling mud around in various forms with various amounts of efficiency.

很多时候，解决方案会在调试过程中自然呈现，通常在您成功再现问题时。

可能是通过再现问题，您获得了修复它所需的知识。

但我认为实际上很少有难题，您可能足够聪明和/或幸运到去解决一个。

我不确定我是否曾经解决过什么难题，至少不是在工作中。

我们大多数人只是在各种形式和效率下拧螺丝。
#+end_quote

