publish/10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#10</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#10</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org939722f">News | Article</a>
<ul>
<li><a href="#orge4882ba">Sanding UI</a></li>
<li><a href="#org7fccbd7">I Like Makefiles</a></li>
<li><a href="#org85f841b">What's inside the QR code menu at this cafe?</a></li>
<li><a href="#org902f74c">It’s Okay to Abandon Things</a></li>
<li><a href="#orgb3bb1ee">You Can't Build Interactive Web Apps Except as Single Page Applications&#x2026; And Other Myths</a></li>
<li><a href="#orgf7f5882">Thoughts on Debugging</a></li>
<li><a href="#orgc1b17ff">Why I still blog after 15 years</a></li>
<li><a href="#org195cc49">How I Think About Debt</a></li>
</ul>
</li>
<li><a href="#org83c1357">Tutorial</a>
<ul>
<li><a href="#orgb792942">HOW TO SUCCEED IN MRBEAST PRODUCTION</a></li>
<li><a href="#org5dc4298">Stanford CS229 I Machine Learning I Building Large Language Models (LLMs)</a></li>
<li><a href="#org60c70b5">Visual guide to SSH tunneling and port forwarding</a></li>
<li><a href="#org82fc49c">Compiling to Assembly from Scratch</a></li>
</ul>
</li>
<li><a href="#org45f5cb8">Code</a>
<ul>
<li><a href="#org57eab45">Component Composition is great btw</a></li>
<li><a href="#org69ed462">9 Principles for Doing Node.js Right in Enterprise Environments</a></li>
<li><a href="#org8da8a5b">A guide to destructuring in JavaScript</a></li>
<li><a href="#org2804bd5">Improving rendering performance with CSS content-visibility</a></li>
<li><a href="#org5df8472">Don't Sleep on AbortController</a></li>
</ul>
</li>
<li><a href="#org6100723">Cool Bit</a>
<ul>
<li><a href="#orga861734">ASCII Silhouettify</a></li>
<li><a href="#orgc567efc">Your Name In Landsat</a></li>
<li><a href="#org463c33b">这个网店用 ssh 卖咖啡</a></li>
<li><a href="#org233a543">time-flies</a></li>
<li><a href="#org28119e2">A look at how I redesigned my website.</a></li>
<li><a href="#orgc8bf5b5">The 34th First Annual Ig Nobel Ceremony</a></li>
<li><a href="#org8e7f744">乡音</a></li>
<li><a href="#orga13abd8">abtest.design</a></li>
<li><a href="#org80d9641">DEPΛR7URE MONO</a></li>
<li><a href="#org91f35f0">Awesome CN Café</a></li>
</ul>
</li>
<li><a href="#orge7e3cd3">博客推荐</a>
<ul>
<li><a href="#org5d15d52">葉開 • 時光記</a></li>
<li><a href="#org3933c8e">midnight serial experiments</a></li>
<li><a href="#org17a9aae">Josh Comeau</a></li>
</ul>
</li>
<li><a href="#org9eb0476">Tool | Library</a>
<ul>
<li><a href="#org2a0fd87">sugarizer</a></li>
<li><a href="#org644e8e9">Kaomoji</a></li>
<li><a href="#org30a8f72">git absorb</a></li>
</ul>
</li>
<li><a href="#org8d7cbd8">Music</a></li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #969896;">// </span><span style="color: #7f0000;">What does this evaluate to?</span>
Array.from<span style="color: #000000;">(</span><span style="color: #dd22dd;">{</span> length: 26 <span style="color: #dd22dd;">}</span>, <span style="color: #dd22dd;">(</span>x, i<span style="color: #dd22dd;">)</span> =&gt; <span style="color: #dd22dd;">(</span>i + 10<span style="color: #dd22dd;">)</span>.toString<span style="color: #dd22dd;">(</span>36<span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>.join<span style="color: #000000;">(</span><span style="color: #3548cf;">", "</span><span style="color: #000000;">)</span>
</pre>
</div>

<div id="outline-container-org939722f" class="outline-2">
<h2 id="org939722f">News | Article</h2>
<div class="outline-text-2" id="text-org939722f">
</div>
<div id="outline-container-orge4882ba" class="outline-3">
<h3 id="orge4882ba"><a href="https://blog.jim-nielsen.com/2024/sanding-ui/">Sanding UI</a></h3>
<div class="outline-text-3" id="text-orge4882ba">
<p>
作者使用 flex 布局实现 radio box，在 label 和 input 之间设置了 gap，发现无法点击，对用户不友好，然后用 padding 替换了 gap。
</p>

<blockquote>
<p>
It’s a small thing, but lots of small splinters lead to an agonizing experience.
</p>

<p>
这是件小事，但很多小碎片会导致痛苦的经历。
</p>

<p>
So my recipe is: sand it, feel the grain, get a splinter, sand again, and repeat until smooth.
</p>

<p>
所以我的秘诀是：打磨，感觉纹理，有刺，再打磨，重复直到光滑为止。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7fccbd7" class="outline-3">
<h3 id="org7fccbd7"><a href="https://switowski.com/blog/i-like-makefiles/">I Like Makefiles</a></h3>
<div class="outline-text-3" id="text-org7fccbd7">
<blockquote>
<p>
The reason I like makefiles is that they often follow an unwritten convention of implementing the same set of commands to get you up and running.
</p>

<p>
我之所以喜欢 makefile，是因为它们通常遵循一种不成文的惯例，即执行同一套命令即可启动和运行。
</p>
</blockquote>

<p>
作者喜欢 makefile，是因为它相对来说比较统一，在不同地方构建一般都是 install，build，dev 几个命令，他自己也会使用 makefile 整合其他构建工具。
</p>

<p>
这样可以减少心智负担，要构建就执行 <code>make build</code> 就好了。
</p>

<p>
就像有的人会买很多同样的衣服，每天就从同样的衣服里拿，不用纠结穿什么衣服。
</p>

<p>
makefile 相关的资源还有：
</p>

<ul class="org-ul">
<li><a href="https://github.com/theicfire/makefiletutorial">makefile tutrorial</a></li>
<li><a href="https://gagor.pro/2024/02/how-i-stopped-worrying-and-loved-makefiles/">How I stopped worrying and loved Makefiles</a></li>
</ul>
</div>
</div>

<div id="outline-container-org85f841b" class="outline-3">
<h3 id="org85f841b"><a href="https://news.ycombinator.com/item?id=41622632">What's inside the QR code menu at this cafe?</a></h3>
<div class="outline-text-3" id="text-org85f841b">
<p>
作者在咖啡店扫了二维码，无聊用网页打开，找到了订单系统的 API，通过 API 可以给其他人下单，获取其他门店的交易情况。
</p>

<p>
一个二维码把整个订单系统都暴露了。
</p>

<p>
不过文章已经下架了。 ┐(シ)┌
</p>
</div>
</div>

<div id="outline-container-org902f74c" class="outline-3">
<h3 id="org902f74c"><a href="https://netninja.com/2024/02/05/its-okay-to-abandon-things/">It’s Okay to Abandon Things</a></h3>
<div class="outline-text-3" id="text-org902f74c">
<p>
和作者类似，当我开始读一本书的时候，如果没有读完，我就不愿意读另一本书。
</p>

<p>
尽管对在读的这本书不感兴趣了，还得逼着自己读完。
</p>

<p>
因为不想读，就搁置在一边，但又不肯开一本新书。
</p>

<p>
作者的建议是可以增加一个“远离书架”：
</p>

<p>
当一本书不想读的时候，可以快速看看结尾，或者看看别人的书评，然后将它放入到“远离书架”。
</p>

<p>
这样你依然有机会看这本书，但从精神上把它放一边，让自己可以轻松一些，去看新的书。
</p>

<blockquote>
<p>
由于上述原因，我的 "当前阅读 "书架上只能有一本书，而且我必须在读完这本书后才能把它移到 "已读 "书架上，然后再换一本新书。
</p>

<p>
去年年底，我创建了第四个书架："远离 "书架。
</p>

<p>
如果我读一本书读得不开心，这个新书架就会给我一定的精神许可，让我可以把它移到 "远离 "书架，继续我的生活。
</p>

<p>
这只是一件小事，似乎并不重要，但它却能让我的大脑允许我不必读完这本书。
</p>

<p>
我仍在追踪这本书，以及我开始写这本书的事实。
</p>

<p>
我没有把它从我的 Goodreads 上完全删除。我只是在精神上（以及在网站上）把它放在一边，为其他东西腾出空间。
</p>

<p>
谁知道呢？也许我以后还会再看，但可能不会了。
</p>

<p>
书架让它保持开放性，但也不会被人遗忘。
</p>
</blockquote>

<blockquote>
<p>
对于电影，至少是在家里看的流媒体电影，我坚持 "十分钟原则"。
</p>

<p>
如果有人在看电影的前十分钟内不感兴趣，就可以拔掉插头。
</p>
</blockquote>

<p>
我觉得 GTD (Getting Thing Done) 也是类似的策略，它要求你将生活的所有事情收集起来，放到一个系统中，这样脑子就不用一直记着有什么事情没做，脑子就会轻松很多，可以去思考别的事情。
</p>

<p>
如果对 GTD 感兴趣，可以看看 <a href="https://www.youtube.com/watch?v=gCswMsONkwY&amp;ab_channel=SuccessfulByDesign">Getting Things Done (GTD) by David Allen - Animated Book Summary And Review</a> 。
</p>
</div>
</div>

<div id="outline-container-orgb3bb1ee" class="outline-3">
<h3 id="orgb3bb1ee"><a href="https://htmx.org/essays/you-cant">You Can't Build Interactive Web Apps Except as Single Page Applications&#x2026; And Other Myths</a></h3>
<div class="outline-text-3" id="text-orgb3bb1ee">
<p>
翻译一下标题：2024 年了，MPA(Multiple Page Application，多页面应用) 能不能用？
</p>

<p>
作者澄清了一些 MPA 开发的误区，看起来目前使用 MPA 也能得到不错的交互体验。
</p>

<blockquote>
<p>
在我们不经意间，浏览器已经缩小了差距，并借鉴了单页面应用程序革命的最佳理念。
</p>

<p>
&#x2026;
</p>

<p>
因此，现在我们可以主要使用浏览器工具 &#x2013; HTML、CSS，也许还有一些 Javascript &#x2013; 来构建交互性很强的甚至是离线的网络应用程序，而且在用户体验方面仍然不会有太大的损失。
</p>

<p>
浏览器已取得长足进步。给它一个机会吧！
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgf7f5882" class="outline-3">
<h3 id="orgf7f5882"><a href="https://catskull.net/thoughts-on-debugging.html">Thoughts on Debugging</a></h3>
<div class="outline-text-3" id="text-orgf7f5882">
<blockquote>
<p>
Here’s my one simple rule for debugging:
</p>

<p>
<b>Reproduce the issue.</b>
</p>

<p>
That’s the only thing, really.
</p>

<p>
There are a lot of barriers to this. This is the antithesis to “it works on my machine”.
</p>

<p>
Debugging is answering the question “why?”.
</p>

<p>
Magic exists, but I’ve never seen any in software. Problems are logical. Nothing is impossible.
</p>

<p>
You can solve this problem. You just need to reproduce the issue.
</p>

<p>
Reproducing the issue should be the team’s number 1 priority.
</p>

<p>
The issue must be reproduced exactly, not just symptoms of the same behavior.
</p>

<p>
这是我调试的一个简单规则:
</p>

<p>
<b>重现问题。</b>
</p>

<p>
这就是关键所在。这其中存在许多障碍。这与"在我的机器上运行正常"的理念完全相反。
</p>

<p>
调试就是回答"为什么?"这个问题。
</p>

<p>
魔法存在，但我从未在软件中见过任何魔法。问题是逻辑性的。没有什么是不可能的。
</p>

<p>
你能解决这个问题。你只需要重现这个问题。
</p>

<p>
重现问题应该是团队的首要任务。
</p>

<p>
必须准确地重现问题，而不仅仅是同样行为的症状。
</p>
</blockquote>

<p>
确实，所谓的“偶现问题”，很多时候只是找不到重现问题的方法。
</p>

<blockquote>
<p>
Often the solution will naturally present itself in the course of debugging, usually by the time you’re successfully reproducing the issue.
</p>

<p>
It could be that by reproducing the problem, you are gaining the required knowledge to fix it.
</p>

<p>
However I think there very few actually hard problems and you’re probably not smart and/or lucky enough to work on one.
</p>

<p>
I’m not sure that I’ve ever worked on a hard problem, at least not for work.
</p>

<p>
We’re mostly just shoveling mud around in various forms with various amounts of efficiency.
</p>

<p>
很多时候，解决方案会在调试过程中自然呈现，通常在您成功再现问题时。
</p>

<p>
可能是通过再现问题，您获得了修复它所需的知识。
</p>

<p>
但我认为实际上很少有难题，您可能足够聪明和/或幸运到去解决一个。
</p>

<p>
我不确定我是否曾经解决过什么难题，至少不是在工作中。
</p>

<p>
我们大多数人只是在各种形式和效率下拧螺丝。
</p>
</blockquote>
</div>
</div>
