post/10.org
** [[https://www.jonashietala.se/blog/2024/09/25/why_i_still_blog_after_15_years/][Why I still blog after 15 years]]

作者回顾了自己写博客的 15 年，为什么写博客，为什么还继续写博客。

关于为什么还继续写，作者的理由是：

- 我喜欢写作
- 写作帮助我思路更清晰，也帮我完善想法
- 发布某些东西迫使我做得更好，因为要发布给别人看，所以需要自己斟酌内容
- 这个博客是一个记录我个人项目的地方
- 看看我已经做过的事情的记录,让我感到更好
- 我乐于将博客作为一个专门解决我自身问题的项目进行开发，可以随便折腾
- 博客写作帮助我成为更好的作家，这又反过来帮助我成为更好的开发人员

#+begin_quote
It’s important to point out that it’s not external feedback that has kept me going all these years.

Yes, of course, it’s nice to get the occasional email with compliments, but that’s just a bonus.

*I keep this blog for me to write, not necessarily for others to read.*

重要的是要指出，并不是外部反馈一直支撑我走到今天。

是的，当然，偶尔收到赞美的电子邮件很不错,但那只是额外的奖赏。

*我保留这个博客是为了让我自己书写，而非必须让别人阅读。*
#+end_quote

** [[https://collabfund.com/blog/how-i-think-about-debt/][How I Think About Debt]]

#+begin_quote
 “Debt defines your future, and when your future is defined, hope begins to die.”

 “债务定义了你的未来，当你的未来被定义时,希望开始消亡。”
#+end_quote

#+begin_quote
But once you view debt as narrowing what you can endure in a volatile world, you start to see it as a constraint on the asset that matters most: having options and flexibility.

但是一旦你将债务视为缩小了你在动荡世界中能够经受的范围，你就会开始将其视为对最重要的资产的约束：拥有选择和灵活性。
#+end_quote

买了房，要背负几十年的房贷，再有了孩子，感觉很多选择确实就不敢做了。


* Tutorial

** [[http://splet.4a.si/dir/How-To-Succeed-At-MrBeast-Production.pdf][HOW TO SUCCEED IN MRBEAST PRODUCTION]]

Mr.Beast 的培训资料，有一些关于如何创建爆火视频的方法。

Mr.Beast 的视频也看过一些，看起来每期视频都成本很高。

** [[https://www.youtube.com/watch?v=9vM4p9NN0Ts&ab_channel=StanfordOnline][Stanford CS229 I Machine Learning I Building Large Language Models (LLMs)]]

** [[https://ittavern.com/visual-guide-to-ssh-tunneling-and-port-forwarding/][Visual guide to SSH tunneling and port forwarding]]

** [[https://keleshev.com/compiling-to-assembly-from-scratch/][Compiling to Assembly from Scratch]]

一本电子书，教你制作一个编译器，学习编译器理论和汇编知识。

书里使用的是 TypeScript 的子集，读起来像伪代码，目标是 ARM 32 位指令集。

* Code

** [[https://tkdodo.eu/blog/component-composition-is-great-btw][Component Composition is great btw]]

在处理条件渲染的时候，组合组件的形式，比将所有逻辑都写在一个组件模板中会更好维护。

好处是：

- 降低心智负担
- 容易扩展
- 更好的类型推断

** [[https://www.platformatichq.com/node-principles][9 Principles for Doing Node.js Right in Enterprise Environments]]

一些 Node.js 最佳实践：

- 不要阻塞事件循环
- 监控 NodeJS 的具体指标并采取相应行动，如内存，CPU 的使用等，当它们达到某个阈值，就需要有措施去应对
- 使用 Node LTS（Long-Term Support） 版本
- 尽可能实现测试、代码审查和一致性的自动化
- 避免依赖性攀升，避免依赖过多
- 降低依赖风险，定期检查，及时更新依赖
- 避免使用全局变量、配置或单例，主要是为了降低耦合
- 处理错误并提供有意义的日志
- 使用应用程序接口规范（如 OpenAPI）并自动生成客户端

** [[https://piccalil.li/blog/a-guide-to-destructuring-in-javascript/][A guide to destructuring in JavaScript]]

JS 中[[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Destructuring_assignment][解构赋值]]的使用介绍，内容比较简单，适合对解构赋值不熟悉的初学者。

** [[https://nolanlawson.com/2024/09/18/improving-rendering-performance-with-css-content-visibility][Improving rendering performance with CSS content-visibility]]

作者要渲染 20K 个表情，但是页面很卡。

最开始想到的是虚拟列表的方案，后来他想到了用 [[https://web.dev/articles/content-visibility][content-visibility]]，实践后确实也有提升，但是性能还是没有虚拟列表的好，但是可以作为一个粗略的替代方案。

** [[https://kettanaito.com/blog/dont-sleep-on-abort-controller][Don't Sleep on AbortController]]

[[https://developer.mozilla.org/en-US/docs/Web/API/AbortController][AbortController]] 的用例，通过封装，你可以通过 AbortController 中断各种逻辑。

* Cool Bit

** [[https://meatfighter.com/ascii-silhouettify/spa/index.html#/][ASCII Silhouettify]]

上传图片，生成 ASCII 图案，效果还不错。

** [[https://landsat.gsfc.nasa.gov/apps/YourNameInLandsat-main/index.html][Your Name In Landsat]]

填写一个英文名，返回对应字母的地理图片，都是真是的地理位置。

** [[https://www.v2ex.com/t/1037342][这个网店用 ssh 卖咖啡]]

=ssh terminal.shop= 会终端打开一个购物页面，挺有趣的。

** [[https://time-flies.koenvangilst.nl/][time-flies]]

“飞蝇时钟”

** [[https://ishadeed.com/article/redesign-2024/][A look at how I redesigned my website.]]

作者重新设计了他的个人网站，首页的 hero part 挺好玩的。

网站的交互和动效都很不错。

最近我也将博客改造了一下，但是相比作者，我这简直就是毛胚房 (/▿＼ )

** [[https://improbable.com/ig/archive/2024-ceremony/][The 34th First Annual Ig Nobel Ceremony]]

2024 年搞笑诺贝尔奖。

- 解剖学奖 ::

  Marjolaine Willems, Quentin Hennocq, Sara Tunon de Lara, Nicolas Kogane, Vincent Fleury, Romy Rayssiguier, Juan José Cortés Santander, Roberto Requena, Julien Stirnemann, and Roman Hossein Khonsari, 研究了大多数人头发的旋转方向(顺时针还是逆时针?)是否与南半球大多数人的头发旋转方向相同。

- 医学奖 ::

  Lieven A. Schenk, Tahmine Fadai, and Christian Büchel，证明引起痛苦副作用的假药比不引起痛苦副作用的假药更有效。

- 概率奖 ::

  František Bartoš, Eric-Jan Wagenmakers, Alexandra Sarafoglou, Henrik Godmann, and many colleagues, 通过理论和 350,757 个实验证明,当你投掷硬币时,它倾向于落在与起始状态相同的一面。

** [[https://web.xiangyin.mobi/][乡音]]

一个方言语音交流平台。

** [[https://abtest.design/][abtest.design]]

一些设计的 A/B test 数据，换了设计，有的提高了 46% 的销售额，足见好的设计的重要性。

** [[https://departuremono.com/][DEPΛR7URE MONO]]

像素风格的字体，网站也很好看。

** [[https://github.com/ElaWorkshop/awesome-cn-cafe][Awesome CN Café]]

在 GitHub 上使用 =.geojson= 后缀的文件，可以显示成地图，并将里面的数据标记在地图上，蛮有趣的。

* 博客推荐

** [[https://qq.md/][葉開 • 時光記]]

** [[https://bilibi.li/][midnight serial experiments]]

简洁的博客。


** [[https://www.joshwcomeau.com/][Josh Comeau]]

Josh Comeau 的博客看起来很不错，而且分享很多关于 CSS 和 JS 的知识，之前经常刷到。

- [[https://www.joshwcomeau.com/blog/how-i-built-my-blog-v2/][How I Built My Blog]] ::

  他分享了他的博客是如何构建出来的。

- [[https://www.joshwcomeau.com/blog/hands-free-coding/][Hands-Free Coding]] ::

  他手患病了，无法用键盘和鼠标，就用语音和眼动仪替代。

* Tool | Library

** [[https://sugarizer.org/][sugarizer]]

一个儿童学习平台。

** [[https://kaomoji.ru/en/][Kaomoji]]

一些颜文字。

