publish/10.html

<div id="outline-container-orgc1b17ff" class="outline-3">
<h3 id="orgc1b17ff"><a href="https://www.jonashietala.se/blog/2024/09/25/why_i_still_blog_after_15_years/">Why I still blog after 15 years</a></h3>
<div class="outline-text-3" id="text-orgc1b17ff">
<p>
作者回顾了自己写博客的 15 年，为什么写博客，为什么还继续写博客。
</p>

<p>
关于为什么还继续写，作者的理由是：
</p>

<ul class="org-ul">
<li>我喜欢写作</li>
<li>写作帮助我思路更清晰，也帮我完善想法</li>
<li>发布某些东西迫使我做得更好，因为要发布给别人看，所以需要自己斟酌内容</li>
<li>这个博客是一个记录我个人项目的地方</li>
<li>看看我已经做过的事情的记录,让我感到更好</li>
<li>我乐于将博客作为一个专门解决我自身问题的项目进行开发，可以随便折腾</li>
<li>博客写作帮助我成为更好的作家，这又反过来帮助我成为更好的开发人员</li>
</ul>

<blockquote>
<p>
It’s important to point out that it’s not external feedback that has kept me going all these years.
</p>

<p>
Yes, of course, it’s nice to get the occasional email with compliments, but that’s just a bonus.
</p>

<p>
<b>I keep this blog for me to write, not necessarily for others to read.</b>
</p>

<p>
重要的是要指出，并不是外部反馈一直支撑我走到今天。
</p>

<p>
是的，当然，偶尔收到赞美的电子邮件很不错,但那只是额外的奖赏。
</p>

<p>
<b>我保留这个博客是为了让我自己书写，而非必须让别人阅读。</b>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org195cc49" class="outline-3">
<h3 id="org195cc49"><a href="https://collabfund.com/blog/how-i-think-about-debt/">How I Think About Debt</a></h3>
<div class="outline-text-3" id="text-org195cc49">
<blockquote>
<p>
“Debt defines your future, and when your future is defined, hope begins to die.”
</p>

<p>
“债务定义了你的未来，当你的未来被定义时,希望开始消亡。”
</p>
</blockquote>

<blockquote>
<p>
But once you view debt as narrowing what you can endure in a volatile world, you start to see it as a constraint on the asset that matters most: having options and flexibility.
</p>

<p>
但是一旦你将债务视为缩小了你在动荡世界中能够经受的范围，你就会开始将其视为对最重要的资产的约束：拥有选择和灵活性。
</p>
</blockquote>

<p>
买了房，要背负几十年的房贷，再有了孩子，感觉很多选择确实就不敢做了。
</p>
</div>
</div>
</div>


<div id="outline-container-org83c1357" class="outline-2">
<h2 id="org83c1357">Tutorial</h2>
<div class="outline-text-2" id="text-org83c1357">
</div>
<div id="outline-container-orgb792942" class="outline-3">
<h3 id="orgb792942"><a href="http://splet.4a.si/dir/How-To-Succeed-At-MrBeast-Production.pdf">HOW TO SUCCEED IN MRBEAST PRODUCTION</a></h3>
<div class="outline-text-3" id="text-orgb792942">
<p>
Mr.Beast 的培训资料，有一些关于如何创建爆火视频的方法。
</p>

<p>
Mr.Beast 的视频也看过一些，看起来每期视频都成本很高。
</p>
</div>
</div>

<div id="outline-container-org5dc4298" class="outline-3">
<h3 id="org5dc4298"><a href="https://www.youtube.com/watch?v=9vM4p9NN0Ts&amp;ab_channel=StanfordOnline">Stanford CS229 I Machine Learning I Building Large Language Models (LLMs)</a></h3>
</div>

<div id="outline-container-org60c70b5" class="outline-3">
<h3 id="org60c70b5"><a href="https://ittavern.com/visual-guide-to-ssh-tunneling-and-port-forwarding/">Visual guide to SSH tunneling and port forwarding</a></h3>
</div>

<div id="outline-container-org82fc49c" class="outline-3">
<h3 id="org82fc49c"><a href="https://keleshev.com/compiling-to-assembly-from-scratch/">Compiling to Assembly from Scratch</a></h3>
<div class="outline-text-3" id="text-org82fc49c">
<p>
一本电子书，教你制作一个编译器，学习编译器理论和汇编知识。
</p>

<p>
书里使用的是 TypeScript 的子集，读起来像伪代码，目标是 ARM 32 位指令集。
</p>
</div>
</div>
</div>

<div id="outline-container-org45f5cb8" class="outline-2">
<h2 id="org45f5cb8">Code</h2>
<div class="outline-text-2" id="text-org45f5cb8">
</div>
<div id="outline-container-org57eab45" class="outline-3">
<h3 id="org57eab45"><a href="https://tkdodo.eu/blog/component-composition-is-great-btw">Component Composition is great btw</a></h3>
<div class="outline-text-3" id="text-org57eab45">
<p>
在处理条件渲染的时候，组合组件的形式，比将所有逻辑都写在一个组件模板中会更好维护。
</p>

<p>
好处是：
</p>

<ul class="org-ul">
<li>降低心智负担</li>
<li>容易扩展</li>
<li>更好的类型推断</li>
</ul>
</div>
</div>

<div id="outline-container-org69ed462" class="outline-3">
<h3 id="org69ed462"><a href="https://www.platformatichq.com/node-principles">9 Principles for Doing Node.js Right in Enterprise Environments</a></h3>
<div class="outline-text-3" id="text-org69ed462">
<p>
一些 Node.js 最佳实践：
</p>

<ul class="org-ul">
<li>不要阻塞事件循环</li>
<li>监控 NodeJS 的具体指标并采取相应行动，如内存，CPU 的使用等，当它们达到某个阈值，就需要有措施去应对</li>
<li>使用 Node LTS（Long-Term Support） 版本</li>
<li>尽可能实现测试、代码审查和一致性的自动化</li>
<li>避免依赖性攀升，避免依赖过多</li>
<li>降低依赖风险，定期检查，及时更新依赖</li>
<li>避免使用全局变量、配置或单例，主要是为了降低耦合</li>
<li>处理错误并提供有意义的日志</li>
<li>使用应用程序接口规范（如 OpenAPI）并自动生成客户端</li>
</ul>
</div>
</div>

<div id="outline-container-org8da8a5b" class="outline-3">
<h3 id="org8da8a5b"><a href="https://piccalil.li/blog/a-guide-to-destructuring-in-javascript/">A guide to destructuring in JavaScript</a></h3>
<div class="outline-text-3" id="text-org8da8a5b">
<p>
JS 中<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Destructuring_assignment">解构赋值</a>的使用介绍，内容比较简单，适合对解构赋值不熟悉的初学者。
</p>
</div>
</div>

<div id="outline-container-org2804bd5" class="outline-3">
<h3 id="org2804bd5"><a href="https://nolanlawson.com/2024/09/18/improving-rendering-performance-with-css-content-visibility">Improving rendering performance with CSS content-visibility</a></h3>
<div class="outline-text-3" id="text-org2804bd5">
<p>
作者要渲染 20K 个表情，但是页面很卡。
</p>

<p>
最开始想到的是虚拟列表的方案，后来他想到了用 <a href="https://web.dev/articles/content-visibility">content-visibility</a>，实践后确实也有提升，但是性能还是没有虚拟列表的好，但是可以作为一个粗略的替代方案。
</p>
</div>
</div>

<div id="outline-container-org5df8472" class="outline-3">
<h3 id="org5df8472"><a href="https://kettanaito.com/blog/dont-sleep-on-abort-controller">Don't Sleep on AbortController</a></h3>
<div class="outline-text-3" id="text-org5df8472">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/API/AbortController">AbortController</a> 的用例，通过封装，你可以通过 AbortController 中断各种逻辑。
</p>
</div>
</div>
</div>

<div id="outline-container-org6100723" class="outline-2">
<h2 id="org6100723">Cool Bit</h2>
<div class="outline-text-2" id="text-org6100723">
</div>
<div id="outline-container-orga861734" class="outline-3">
<h3 id="orga861734"><a href="https://meatfighter.com/ascii-silhouettify/spa/index.html#/">ASCII Silhouettify</a></h3>
<div class="outline-text-3" id="text-orga861734">
<p>
上传图片，生成 ASCII 图案，效果还不错。
</p>
</div>
</div>

<div id="outline-container-orgc567efc" class="outline-3">
<h3 id="orgc567efc"><a href="https://landsat.gsfc.nasa.gov/apps/YourNameInLandsat-main/index.html">Your Name In Landsat</a></h3>
<div class="outline-text-3" id="text-orgc567efc">
<p>
填写一个英文名，返回对应字母的地理图片，都是真是的地理位置。
</p>
</div>
</div>

<div id="outline-container-org463c33b" class="outline-3">
<h3 id="org463c33b"><a href="https://www.v2ex.com/t/1037342">这个网店用 ssh 卖咖啡</a></h3>
<div class="outline-text-3" id="text-org463c33b">
<p>
<code>ssh terminal.shop</code> 会终端打开一个购物页面，挺有趣的。
</p>
</div>
</div>

<div id="outline-container-org233a543" class="outline-3">
<h3 id="org233a543"><a href="https://time-flies.koenvangilst.nl/">time-flies</a></h3>
<div class="outline-text-3" id="text-org233a543">
<p>
“飞蝇时钟”
</p>
</div>
</div>

<div id="outline-container-org28119e2" class="outline-3">
<h3 id="org28119e2"><a href="https://ishadeed.com/article/redesign-2024/">A look at how I redesigned my website.</a></h3>
<div class="outline-text-3" id="text-org28119e2">
<p>
作者重新设计了他的个人网站，首页的 hero part 挺好玩的。
</p>

<p>
网站的交互和动效都很不错。
</p>

<p>
最近我也将博客改造了一下，但是相比作者，我这简直就是毛胚房 (/▿＼ )
</p>
</div>
</div>

<div id="outline-container-orgc8bf5b5" class="outline-3">
<h3 id="orgc8bf5b5"><a href="https://improbable.com/ig/archive/2024-ceremony/">The 34th First Annual Ig Nobel Ceremony</a></h3>
<div class="outline-text-3" id="text-orgc8bf5b5">
<p>
2024 年搞笑诺贝尔奖。
</p>

<dl class="org-dl">
<dt>解剖学奖</dt><dd>Marjolaine Willems, Quentin Hennocq, Sara Tunon de Lara, Nicolas Kogane, Vincent Fleury, Romy Rayssiguier, Juan José Cortés Santander, Roberto Requena, Julien Stirnemann, and Roman Hossein Khonsari, 研究了大多数人头发的旋转方向 (顺时针还是逆时针？) 是否与南半球大多数人的头发旋转方向相同。</dd>

<dt>医学奖</dt><dd>Lieven A. Schenk, Tahmine Fadai, and Christian Büchel，证明引起痛苦副作用的假药比不引起痛苦副作用的假药更有效。</dd>

<dt>概率奖</dt><dd>František Bartoš, Eric-Jan Wagenmakers, Alexandra Sarafoglou, Henrik Godmann, and many colleagues， 通过理论和 350,757 个实验证明，当你投掷硬币时，它倾向于落在与起始状态相同的一面。</dd>
</dl>
</div>
</div>

<div id="outline-container-org8e7f744" class="outline-3">
<h3 id="org8e7f744"><a href="https://web.xiangyin.mobi/">乡音</a></h3>
<div class="outline-text-3" id="text-org8e7f744">
<p>
一个方言语音交流平台。
</p>
</div>
</div>

<div id="outline-container-orga13abd8" class="outline-3">
<h3 id="orga13abd8"><a href="https://abtest.design/">abtest.design</a></h3>
<div class="outline-text-3" id="text-orga13abd8">
<p>
一些设计的 A/B test 数据，换了设计，有的提高了 46% 的销售额，足见好的设计的重要性。
</p>
</div>
</div>

<div id="outline-container-org80d9641" class="outline-3">
<h3 id="org80d9641"><a href="https://departuremono.com/">DEPΛR7URE MONO</a></h3>
<div class="outline-text-3" id="text-org80d9641">
<p>
像素风格的字体，网站也很好看。
</p>
</div>
</div>

<div id="outline-container-org91f35f0" class="outline-3">
<h3 id="org91f35f0"><a href="https://github.com/ElaWorkshop/awesome-cn-cafe">Awesome CN Café</a></h3>
<div class="outline-text-3" id="text-org91f35f0">
<p>
在 GitHub 上使用 <code>.geojson</code> 后缀的文件，可以显示成地图，并将里面的数据标记在地图上，蛮有趣的。
</p>
</div>
</div>
</div>

<div id="outline-container-orge7e3cd3" class="outline-2">
<h2 id="orge7e3cd3">博客推荐</h2>
<div class="outline-text-2" id="text-orge7e3cd3">
</div>
<div id="outline-container-org5d15d52" class="outline-3">
<h3 id="org5d15d52"><a href="https://qq.md/">葉開 • 時光記</a></h3>
</div>

<div id="outline-container-org3933c8e" class="outline-3">
<h3 id="org3933c8e"><a href="https://bilibi.li/">midnight serial experiments</a></h3>
<div class="outline-text-3" id="text-org3933c8e">
<p>
简洁的博客。
</p>
</div>
</div>


<div id="outline-container-org17a9aae" class="outline-3">
<h3 id="org17a9aae"><a href="https://www.joshwcomeau.com/">Josh Comeau</a></h3>
<div class="outline-text-3" id="text-org17a9aae">
<p>
Josh Comeau 的博客看起来很不错，而且分享很多关于 CSS 和 JS 的知识，之前经常刷到。
</p>

<dl class="org-dl">
<dt><a href="https://www.joshwcomeau.com/blog/how-i-built-my-blog-v2/">How I Built My Blog</a></dt><dd>他分享了他的博客是如何构建出来的。</dd>

<dt><a href="https://www.joshwcomeau.com/blog/hands-free-coding/">Hands-Free Coding</a></dt><dd>他手患病了，无法用键盘和鼠标，就用语音和眼动仪替代。</dd>
</dl>
</div>
</div>
</div>
